coding/python/tricks.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+INCLUDE: "../../layout/template.org"
#+SETUPFILE: "../../layout/extension.org"
#+title:

* Python中执行shell命令
#+begin_src python
from subprocess import call
call(["ls", "-l"])
#+end_src
* COMMENT 函数参数若是元组则用*若为字典则用** 或用 apply 函数
  apply函数为__builtin__模块（自动加载）中的函数：
#+begin_src python
apply(object[, args[, kwargs]]) -> value
#+end_src
  其中args为元组，kwargs为字典
#+begin_src python
def fun(a, b):
    print a, b
x=('aa','bb')
apply(fun,x)
y={'a':'aa', 'b':'bb'}
#apply(obj[,args[,kargs]])第2个参数是tuple类型，为空，所以用()
apply(fun,(),y)
fun(*x)
fun(**y)
#+end_src  
* python3安装module
  #+BEGIN_EXAMPLE
  python3 -m pip install BeautifulSoup4
  #+END_EXAMPLE
* history commands in interactive python
  http://stackoverflow.com/questions/6558765/how-do-you-see-the-entire-command-history-in-interactive-python
  #+BEGIN_SRC python
    import readline
    for i in range(readline.get_current_history_length()):
        print readline.get_history_item(i)  
  #+END_SRC
