coding/python/tricks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title></title>
<!-- 2014-12-13 Sat 23:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Python中执行shell命令</a></li>
<li><a href="#sec-2">2. python3安装module</a></li>
<li><a href="#sec-3">3. history commands in interactive python</a></li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../layout/css/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../layout/css/style.css" />
<script src="../../layout/js/jquery_1.7.1.js"></script>
<script src="../../layout/js/bootstrap_old.js"></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Python中执行shell命令</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a020f0;">from</span> subprocess <span style="color: #a020f0;">import</span> call
call([<span style="color: #8b2252;">"ls"</span>, <span style="color: #8b2252;">"-l"</span>])
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> python3安装module</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
python3 -m pip install BeautifulSoup4
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> history commands in interactive python</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="http://stackoverflow.com/questions/6558765/how-do-you-see-the-entire-command-history-in-interactive-python">http://stackoverflow.com/questions/6558765/how-do-you-see-the-entire-command-history-in-interactive-python</a><br/>
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #a020f0;">import</span> readline
<span style="color: #a020f0;">for</span> i <span style="color: #a020f0;">in</span> <span style="color: #483d8b;">range</span>(readline.get_current_history_length()):
    <span style="color: #a020f0;">print</span> readline.get_history_item(i)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
